let title = document.querySelectorAll('.card__title');


let Arr = ["اللهم صلي وسلم وبارك على سيدنا محمد",
"اشهد ان لا اله الا الله وان محمد رسول الله",
"الله لا اله الا انت سبحانك اني كنت من الظالمين",
"استغفر الله العظيم واتوب اليه","سبحان الله وبحمده سبحان الله العظيم",
"اللهم اغفر لي جهلي وإسرافي في أمري، وما أنت أعلم به منِّي، اللهم اغفر لي جدي وهزلي وخطئي وعمدي وكلّ ذلك عندي",
"يا ربّ اغفر لي ذنبي كلّه، دقّه وجلّه، وأوّله وآخره، وسرّه وعلاينته).[١٦]",
"•حديث رسول الله -صلى الله عليه وسلم-: ﻿(اللهمَّ إنك عفوٌّ تُحبُّ العفوَ فاعفُ عنِّي",
"اللهم إني مستغيث أستمطر رحمتك الواسعة من خزائن جودك. فأغثني يا رحمن, لا إله إلا أنت سبحانك، اللهم وبحمدك، إني ظلمت نفسي كثيرا. فارحمني يا أرحم الراحمين.",
"(وَقُل رَّبِّ اغْفِرْ وَارْحَمْ وَأَنتَ خَيْرُ الرَّاحِمِينَ) . [المؤمنون: 118].",
"(فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ ۚ إِنَّهُ كَانَ تَوَّابًا). [النصر: 3].",
"(قَالَا رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ). [الأعراف: 23].",
"(لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ) . [البقرة: 286].",
"عن الأغر المزني -رضي الله عنه-، أن رسول الله -صلى الله عليه وسلم-، قال : «إني لأستغفر الله في اليوم مائة مرة». رواه مسلم (2702) .",
"وعن أبي موسى، عن النبي -صلى الله عليه وسلم-، أنه كان يدعو بهذا الدعاء : «اللهم اغفر لي خطيئتي وجهلي وإسرافي في أمري وما أنت أعلم به مني اللهم اغفر لي جدي وهزلي وخطئي وعمدي وكل ذلك عندي، اللهم اغفر لي ما قدمت وما أخرت وما أسررت وما أعلنت وما أنت أعلم به مني. أنت المقدم وأنت المؤخر وأنت على كل شيء قدير",
"اللهم إني أستغفرك من كل ذنب يصرف عني رحمتك، أو يحل بي نقمتك ، أو يحرمني كرمك، أو يزيل عني نعمتك.",
];
let click = document.getElementById('click')


click.addEventListener('click',
    function (mero) {
        title[0].innerHTML = Arr[Math.floor(Math.random() * Arr.length)];
    })